# Вывести последнюю букву в слове
word = 'Архангельск'
# ?
print(word[-1])


# Вывести количество букв "а" в слове
word = 'Архангельск'
# ???
print(len(word))


# Вывести количество гласных букв в слове
word = 'Архангельск'
# ???


# Вывести количество слов в предложении
sentence = 'Мы приехали в гости'
# ???
bz = len(sentence.split(" "))
print(bz)

# Вывести первую букву каждого слова на отдельной строке
sentence = 'Мы приехали в гости'
# ???
bz = str(sentence.split(" "))
pervaya = bz
print(pervaya)


# Вывести усреднённую длину слова.
sentence = 'Мы приехали в гости'
# ???